In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [7]:
df=pd.read_csv(r"C:\Users\kanda\Downloads\Mall_Customers.csv")

In [9]:
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [11]:
df.tail()

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

In [13]:
df.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [15]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df=df.dropna()

In [63]:
df.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)', 'gender', 'column'],
      dtype='object')

In [39]:
df['column']=df['CustomerID'].fillna(df['CustomerID'].mean())

In [41]:
df['column']=df['Age'].fillna(df['Age'].mean())

In [65]:
df['column']=df['Annual Income (k$)'].fillna(df['Annual Income (k$)'].mean())

In [70]:
df['column']=df['Spending Score (1-100)'].fillna(df['Spending Score (1-100)'].mean())

In [72]:
df['gender']=df['Gender'].fillna(df['Gender'].mode()[0])

In [89]:
df = df.drop_duplicates()

In [91]:
df['gender']=df['gender'].str.lower()

In [97]:
df.columns=df.columns.str.strip().str.lower().str.replace(" ","_")

In [101]:
df.to_csv("cleaned_dataset.csv",index=False)

In [110]:
df

,customerid,gender,age,annual_income_(k$),spending_score_(1-100),gender,column
0,1,Male,19,15,39,male,39
1,2,Male,21,15,81,male,81
2,3,Female,20,16,6,female,6
3,4,Female,23,16,77,female,77
4,5,Female,31,17,40,female,40
...,...,...,...,...,...,...,...
195,196,Female,35,120,79,female,79
196,197,Female,45,126,28,female,28
197,198,Male,32,126,74,male,74
198,199,Male,32,137,18,male,18
199,200,Male,30,137,83,male,83

In [105]:
df.isnull().sum()

customerid                0
gender                    0
age                       0
annual_income_(k$)        0
spending_score_(1-100)    0
gender                    0
column                    0
dtype: int64

In [128]:
df.columns

Index(['customerid', 'gender', 'age', 'annual_income_(k$)',
       'spending_score_(1-100)', 'gender', 'column'],
      dtype='object')

In [138]:
df=df.drop_duplicates(subset=['gender','column'])

In [141]:
df

,customerid,gender,age,annual_income_(k$),spending_score_(1-100),gender,column
0,1,Male,19,15,39,male,39
1,2,Male,21,15,81,male,81
2,3,Female,20,16,6,female,6
3,4,Female,23,16,77,female,77
4,5,Female,31,17,40,female,40
...,...,...,...,...,...,...,...
193,194,Female,38,113,91,female,91
195,196,Female,35,120,79,female,79
197,198,Male,32,126,74,male,74
198,199,Male,32,137,18,male,18
199,200,Male,30,137,83,male,83

In [143]:
df.isnull().sum()

customerid                0
gender                    0
age                       0
annual_income_(k$)        0
spending_score_(1-100)    0
gender                    0
column                    0
dtype: int64

In [155]:
df['gender']=df['gender'].astype(str)

In [157]:
df['customerid']=df['customerid'].astype(int)

In [159]:
df['age']=df['age'].astype(int)

In [161]:
df['annual_income_(k$)']=df['annual_income_(k$)'].astype(int)

In [163]:
df['spending_score_(1-100)']=df['spending_score_(1-100)'].astype(int)

In [167]:
type(df)

pandas.core.frame.DataFrame

SUMMARY of Changes

In [201]:
#1)Removed duplicates
#2)Filled missing values
#3)Fixed inconsistent formatting
#4)standardized text columns
#5)covert the formats
#6)updated column names
#7)Ensured correct data types